### Loading Modules

In [1]:
import sqlite3

In [2]:
conn = sqlite3.connect("data/lesson.db")

In [3]:
dir(conn)

['DataError',
 'DatabaseError',
 'Error',
 'IntegrityError',
 'InterfaceError',
 'InternalError',
 'NotSupportedError',
 'OperationalError',
 'ProgrammingError',
 'Warning',
 '__call__',
 '__class__',
 '__delattr__',
 '__dir__',
 '__doc__',
 '__enter__',
 '__eq__',
 '__exit__',
 '__format__',
 '__ge__',
 '__getattribute__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__le__',
 '__lt__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 'backup',
 'close',
 'commit',
 'create_aggregate',
 'create_collation',
 'create_function',
 'cursor',
 'enable_load_extension',
 'execute',
 'executemany',
 'executescript',
 'in_transaction',
 'interrupt',
 'isolation_level',
 'iterdump',
 'load_extension',
 'rollback',
 'row_factory',
 'set_authorizer',
 'set_progress_handler',
 'set_trace_callback',
 'text_factory',
 'total_changes']

In [4]:
conn.cursor()

In [5]:
conn.close()

In [6]:
with sqlite3.connect("data/lesson.db") as conn:
    pass

### DDL and DML Commands in SQLite

In [7]:
conn = sqlite3.connect("data/lesson.db")

In [8]:
cursor = conn.cursor()

In [9]:
cursor.execute("CREATE TABLE IF NOT EXISTS user (email text, first_name text, last_name text,\
address text, age integer, PRIMARY KEY (email))")

In [11]:
cursor.execute("INSERT INTO user VALUES ('bob@example.com', 'Bob','Codd', '123 Fantasy lane, Fantasu City', 31)")
cursor.execute("INSERT INTO user VALUES ('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39)")

IntegrityError: UNIQUE constraint failed: user.email

In [12]:
cursor.execute("DELETE FROM user")

In [15]:
data = [('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31),
('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39)]
stmt = "INSERT INTO user VALUES(?, ?, ?, ?, ?)"

In [16]:
cursor.executemany(stmt, data)

In [17]:
conn.commit()

### Reading Data from a Database in SQLite

In [18]:
rows = cursor.execute('SELECT * FROM user')
for i,row in enumerate(rows):
    print(f'Row# {i+1}:{row}')

Row# 1:('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31)
Row# 2:('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39)

In [19]:
rows = cursor.execute('SELECT * FROM user')
rows.fetchall()

[('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31),
 ('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39)]

In [20]:
rows = cursor.execute('SELECT * FROM user LIMIT 1')
rows.fetchall()

[('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31)]

### Sorting Values in the Database

In [18]:
rows = cursor.execute('SELECT * FROM user ORDER BY age DESC')
rows.fetchall()

[('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39),
 ('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31)]

### Altering Table Structure and Updating New Columns

In [21]:
cursor.execute("ALTER TABLE user ADD COLUMN gender text")

In [22]:
rows = cursor.execute('SELECT * FROM user ORDER BY age DESC')
rows.fetchall()

[('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39, None),
 ('bob@example.com',
  'Bob',
  'Codd',
  '123 Fantasy lane, Fantasu City',
  31,
  None)]

In [23]:
cursor.execute("UPDATE user SET gender='M'")

In [24]:
rows = cursor.execute('SELECT * FROM user ORDER BY age DESC')
rows.fetchall()

[('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39, 'M'),
 ('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, 'M')]

In [25]:
conn.commit()

### Grouping Values in Tables

In [26]:
cursor.execute("INSERT INTO user VALUES ('shelly@www.com', 'Shelly','Milar', '123, Ocean View Lane', 39, 'F')")
conn.commit()

In [27]:
rows = cursor.execute('SELECT * FROM user ORDER BY gender DESC')
rows.fetchall()

[('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, 'M'),
 ('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39, 'M'),
 ('shelly@www.com', 'Shelly', 'Milar', '123, Ocean View Lane', 39, 'F')]

In [28]:
rows = cursor.execute('SELECT * FROM user ORDER BY gender')
rows.fetchall()

[('shelly@www.com', 'Shelly', 'Milar', '123, Ocean View Lane', 39, 'F'),
 ('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, 'M'),
 ('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39, 'M')]

In [29]:
rows = cursor.execute('SELECT COUNT(*),gender FROM user GROUP BY gender')
rows.fetchall()

[(1, 'F'), (2, 'M')]

In [31]:
rows = cursor.execute('SELECT gender,COUNT(*) FROM user GROUP BY gender')
rows.fetchall()

[('F', 1), ('M', 2)]

In [33]:
rows = cursor.execute('SELECT gender,MIN(age) FROM user GROUP BY gender')
rows.fetchall()

[('F', 39), ('M', 31)]

In [34]:
rows = cursor.execute('SELECT gender,MAX(age) FROM user GROUP BY gender')
rows.fetchall()

[('F', 39), ('M', 39)]

In [35]:
rows = cursor.execute('SELECT gender,AVG(age) FROM user GROUP BY gender')
rows.fetchall()

[('F', 39.0), ('M', 35.0)]

In [37]:
rows = cursor.execute('SELECT gender, COUNT(*) FROM user GROUP BY gender')
rows.fetchall()

[('F', 1), ('M', 2)]

### Relational Mapping in Databases

In [38]:
cursor.execute("PRAGMA foreign_keys = 1")

In [39]:
sql = """
CREATE TABLE comments (
user_id text,
comments text,
FOREIGN KEY (user_id) REFERENCES user (email)
ON DELETE CASCADE ON UPDATE CASCADE)
"""

In [40]:
cursor.execute(sql)
conn.commit()

In [41]:
rows = cursor.execute('SELECT * FROM comments')
rows.fetchall()

[]

In [42]:
rows = cursor.execute('SELECT * FROM user ORDER BY age')
rows.fetchall()

[('bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, 'M'),
 ('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39, 'M'),
 ('shelly@www.com', 'Shelly', 'Milar', '123, Ocean View Lane', 39, 'F')]

In [43]:
sql = "INSERT INTO comments VALUES ('{}', '{}')"
rows = cursor.execute('SELECT * FROM user ORDER BY age')
for row in rows:
    email = row[0]
    #print("Going to create rows for {}".format(email))
    print(f'Going to create rows for {email}')
    #name = row[1] + " " + row[2]
    name = f'{row[1]} {row[2]}'
    for i in range(10):
        #comment = "This is comment {} by {}".format(i, name)
        comment = f'This is comment {i} by {name}'
        conn.cursor().execute(sql.format(email, comment))
conn.commit()

Going to create rows for bob@example.com
Going to create rows for tom@web.com
Going to create rows for shelly@www.com

In [44]:
rows = cursor.execute('SELECT * FROM comments')
for i, row in enumerate(rows):
    if (i % 5 == 0):
        print(row)
    i += 1

('bob@example.com', 'This is comment 0 by Bob Codd')
('bob@example.com', 'This is comment 5 by Bob Codd')
('tom@web.com', 'This is comment 0 by Tom Fake')
('tom@web.com', 'This is comment 5 by Tom Fake')
('shelly@www.com', 'This is comment 0 by Shelly Milar')
('shelly@www.com', 'This is comment 5 by Shelly Milar')

In [45]:
rows = cursor.execute('SELECT * FROM comments')
rows.fetchall()

[('bob@example.com', 'This is comment 0 by Bob Codd'),
 ('bob@example.com', 'This is comment 1 by Bob Codd'),
 ('bob@example.com', 'This is comment 2 by Bob Codd'),
 ('bob@example.com', 'This is comment 3 by Bob Codd'),
 ('bob@example.com', 'This is comment 4 by Bob Codd'),
 ('bob@example.com', 'This is comment 5 by Bob Codd'),
 ('bob@example.com', 'This is comment 6 by Bob Codd'),
 ('bob@example.com', 'This is comment 7 by Bob Codd'),
 ('bob@example.com', 'This is comment 8 by Bob Codd'),
 ('bob@example.com', 'This is comment 9 by Bob Codd'),
 ('tom@web.com', 'This is comment 0 by Tom Fake'),
 ('tom@web.com', 'This is comment 1 by Tom Fake'),
 ('tom@web.com', 'This is comment 2 by Tom Fake'),
 ('tom@web.com', 'This is comment 3 by Tom Fake'),
 ('tom@web.com', 'This is comment 4 by Tom Fake'),
 ('tom@web.com', 'This is comment 5 by Tom Fake'),
 ('tom@web.com', 'This is comment 6 by Tom Fake'),
 ('tom@web.com', 'This is comment 7 by Tom Fake'),
 ('tom@web.com', 'This is comment 8 by Tom Fake'),
 ('tom@web.com', 'This is comment 9 by Tom Fake'),
 ('shelly@www.com', 'This is comment 0 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 1 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 2 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 3 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 4 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 5 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 6 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 7 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 8 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 9 by Shelly Milar')]

### Joins

In [46]:
sql = """
SELECT * FROM comments
JOIN user ON comments.user_id = user.email
WHERE user.email='bob@example.com'
LIMIT 3
"""

In [47]:
rows = cursor.execute(sql)
for row in rows:
    print(row)

('bob@example.com', 'This is comment 0 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, 'M')
('bob@example.com', 'This is comment 1 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, 'M')
('bob@example.com', 'This is comment 2 by Bob Codd', 'bob@example.com', 'Bob', 'Codd', '123 Fantasy lane, Fantasu City', 31, 'M')

In [48]:
sql = """
SELECT comments.* FROM user
JOIN comments ON comments.user_id = user.email
WHERE user.email='bob@example.com'
LIMIT 4
"""
rows = cursor.execute(sql)
for row in rows:
    print(row)

('bob@example.com', 'This is comment 0 by Bob Codd')
('bob@example.com', 'This is comment 1 by Bob Codd')
('bob@example.com', 'This is comment 2 by Bob Codd')
('bob@example.com', 'This is comment 3 by Bob Codd')

In [49]:
sql = """
SELECT email,comments FROM user
JOIN comments ON comments.user_id = user.email
WHERE user.email='bob@example.com'
LIMIT 4
"""
rows = cursor.execute(sql)
for row in rows:
    print(row)

('bob@example.com', 'This is comment 0 by Bob Codd')
('bob@example.com', 'This is comment 1 by Bob Codd')
('bob@example.com', 'This is comment 2 by Bob Codd')
('bob@example.com', 'This is comment 3 by Bob Codd')

In [50]:
sql = """
SELECT first_name, last_name, comments FROM user
JOIN comments ON comments.user_id = user.email
WHERE user.email='bob@example.com'
"""
rows = cursor.execute(sql)
for row in rows:
    print(row)

('Bob', 'Codd', 'This is comment 0 by Bob Codd')
('Bob', 'Codd', 'This is comment 1 by Bob Codd')
('Bob', 'Codd', 'This is comment 2 by Bob Codd')
('Bob', 'Codd', 'This is comment 3 by Bob Codd')
('Bob', 'Codd', 'This is comment 4 by Bob Codd')
('Bob', 'Codd', 'This is comment 5 by Bob Codd')
('Bob', 'Codd', 'This is comment 6 by Bob Codd')
('Bob', 'Codd', 'This is comment 7 by Bob Codd')
('Bob', 'Codd', 'This is comment 8 by Bob Codd')
('Bob', 'Codd', 'This is comment 9 by Bob Codd')

### Deleting Rows From a Table

In [51]:
cursor.execute("DELETE FROM user WHERE email='bob@example.com'")
conn.commit()

In [52]:
rows = cursor.execute('SELECT * FROM user ORDER BY gender')
for i,row in enumerate(rows):
    print(f'Row# {i+1}:{row}')

Row# 1:('shelly@www.com', 'Shelly', 'Milar', '123, Ocean View Lane', 39, 'F')
Row# 2:('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39, 'M')

In [53]:
rows = cursor.execute("SELECT * FROM comments LIMIT 18")
for row in rows:
    print(row)

('tom@web.com', 'This is comment 0 by Tom Fake')
('tom@web.com', 'This is comment 1 by Tom Fake')
('tom@web.com', 'This is comment 2 by Tom Fake')
('tom@web.com', 'This is comment 3 by Tom Fake')
('tom@web.com', 'This is comment 4 by Tom Fake')
('tom@web.com', 'This is comment 5 by Tom Fake')
('tom@web.com', 'This is comment 6 by Tom Fake')
('tom@web.com', 'This is comment 7 by Tom Fake')
('tom@web.com', 'This is comment 8 by Tom Fake')
('tom@web.com', 'This is comment 9 by Tom Fake')
('shelly@www.com', 'This is comment 0 by Shelly Milar')
('shelly@www.com', 'This is comment 1 by Shelly Milar')
('shelly@www.com', 'This is comment 2 by Shelly Milar')
('shelly@www.com', 'This is comment 3 by Shelly Milar')
('shelly@www.com', 'This is comment 4 by Shelly Milar')
('shelly@www.com', 'This is comment 5 by Shelly Milar')
('shelly@www.com', 'This is comment 6 by Shelly Milar')
('shelly@www.com', 'This is comment 7 by Shelly Milar')

### Updating Specific Values in a Table

In [59]:
cursor.execute("UPDATE user SET first_name='Chris' WHERE email='tom@web.com'")
conn.commit()
rows = cursor.execute("SELECT * FROM user")
for row in rows:
    print(row)

('tom@outlook.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39, 'M')
('shelly@www.com', 'Shelly', 'Milar', '123, Ocean View Lane', 39, 'F')

In [60]:
rows = cursor.execute("SELECT * FROM comments LIMIT 18")
for row in rows:
    print(row)

('tom@outlook.com', 'This is comment 0 by Tom Fake')
('tom@outlook.com', 'This is comment 1 by Tom Fake')
('tom@outlook.com', 'This is comment 2 by Tom Fake')
('tom@outlook.com', 'This is comment 3 by Tom Fake')
('tom@outlook.com', 'This is comment 4 by Tom Fake')
('tom@outlook.com', 'This is comment 5 by Tom Fake')
('tom@outlook.com', 'This is comment 6 by Tom Fake')
('tom@outlook.com', 'This is comment 7 by Tom Fake')
('tom@outlook.com', 'This is comment 8 by Tom Fake')
('tom@outlook.com', 'This is comment 9 by Tom Fake')
('shelly@www.com', 'This is comment 0 by Shelly Milar')
('shelly@www.com', 'This is comment 1 by Shelly Milar')
('shelly@www.com', 'This is comment 2 by Shelly Milar')
('shelly@www.com', 'This is comment 3 by Shelly Milar')
('shelly@www.com', 'This is comment 4 by Shelly Milar')
('shelly@www.com', 'This is comment 5 by Shelly Milar')
('shelly@www.com', 'This is comment 6 by Shelly Milar')
('shelly@www.com', 'This is comment 7 by Shelly Milar')

In [61]:
cursor.execute("UPDATE user SET first_name='Tom' WHERE email='tom@web.com'")
conn.commit()
rows = cursor.execute("SELECT * FROM user")
for row in rows:
    print(row)

('tom@outlook.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39, 'M')
('shelly@www.com', 'Shelly', 'Milar', '123, Ocean View Lane', 39, 'F')

In [62]:
cursor.execute("UPDATE user SET email='tom@outlook.com' WHERE email ='tom@web.com'")
conn.commit()
rows = cursor.execute("SELECT * FROM user")
for row in rows:
    print(row)

('tom@outlook.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39, 'M')
('shelly@www.com', 'Shelly', 'Milar', '123, Ocean View Lane', 39, 'F')

In [63]:
rows = cursor.execute("SELECT * FROM comments LIMIT 18")
for row in rows:
    print(row)

('tom@outlook.com', 'This is comment 0 by Tom Fake')
('tom@outlook.com', 'This is comment 1 by Tom Fake')
('tom@outlook.com', 'This is comment 2 by Tom Fake')
('tom@outlook.com', 'This is comment 3 by Tom Fake')
('tom@outlook.com', 'This is comment 4 by Tom Fake')
('tom@outlook.com', 'This is comment 5 by Tom Fake')
('tom@outlook.com', 'This is comment 6 by Tom Fake')
('tom@outlook.com', 'This is comment 7 by Tom Fake')
('tom@outlook.com', 'This is comment 8 by Tom Fake')
('tom@outlook.com', 'This is comment 9 by Tom Fake')
('shelly@www.com', 'This is comment 0 by Shelly Milar')
('shelly@www.com', 'This is comment 1 by Shelly Milar')
('shelly@www.com', 'This is comment 2 by Shelly Milar')
('shelly@www.com', 'This is comment 3 by Shelly Milar')
('shelly@www.com', 'This is comment 4 by Shelly Milar')
('shelly@www.com', 'This is comment 5 by Shelly Milar')
('shelly@www.com', 'This is comment 6 by Shelly Milar')
('shelly@www.com', 'This is comment 7 by Shelly Milar')

In [64]:
cursor.execute("UPDATE user SET email='tom@web.com' WHERE email='tom@outlook.com'")
conn.commit()
rows = cursor.execute("SELECT * FROM user")
for row in rows:
    print(row)

('tom@web.com', 'Tom', 'Fake', '123 Fantasy lane, Fantasu City', 39, 'M')
('shelly@www.com', 'Shelly', 'Milar', '123, Ocean View Lane', 39, 'F')

### RDBMS and DataFrames

In [65]:
import pandas as pd

In [71]:
columns = ["Email", "First Name", "Last Name", "Age", "Gender", "Comments"]
data = []

In [72]:
sql = """
SELECT user.email, user.first_name, user.last_name, user.age, user.gender, comments.comments FROM comments
JOIN user ON comments.user_id = user.email
"""

In [73]:
rows = cursor.execute(sql)
rows

In [74]:
for row in rows:
    data.append(row)

In [75]:
data

[('tom@web.com', 'Tom', 'Fake', 39, 'M', 'This is comment 0 by Tom Fake'),
 ('tom@web.com', 'Tom', 'Fake', 39, 'M', 'This is comment 1 by Tom Fake'),
 ('tom@web.com', 'Tom', 'Fake', 39, 'M', 'This is comment 2 by Tom Fake'),
 ('tom@web.com', 'Tom', 'Fake', 39, 'M', 'This is comment 3 by Tom Fake'),
 ('tom@web.com', 'Tom', 'Fake', 39, 'M', 'This is comment 4 by Tom Fake'),
 ('tom@web.com', 'Tom', 'Fake', 39, 'M', 'This is comment 5 by Tom Fake'),
 ('tom@web.com', 'Tom', 'Fake', 39, 'M', 'This is comment 6 by Tom Fake'),
 ('tom@web.com', 'Tom', 'Fake', 39, 'M', 'This is comment 7 by Tom Fake'),
 ('tom@web.com', 'Tom', 'Fake', 39, 'M', 'This is comment 8 by Tom Fake'),
 ('tom@web.com', 'Tom', 'Fake', 39, 'M', 'This is comment 9 by Tom Fake'),
 ('shelly@www.com',
  'Shelly',
  'Milar',
  39,
  'F',
  'This is comment 0 by Shelly Milar'),
 ('shelly@www.com',
  'Shelly',
  'Milar',
  39,
  'F',
  'This is comment 1 by Shelly Milar'),
 ('shelly@www.com',
  'Shelly',
  'Milar',
  39,
  'F',
  'This is comment 2 by Shelly Milar'),
 ('shelly@www.com',
  'Shelly',
  'Milar',
  39,
  'F',
  'This is comment 3 by Shelly Milar'),
 ('shelly@www.com',
  'Shelly',
  'Milar',
  39,
  'F',
  'This is comment 4 by Shelly Milar'),
 ('shelly@www.com',
  'Shelly',
  'Milar',
  39,
  'F',
  'This is comment 5 by Shelly Milar'),
 ('shelly@www.com',
  'Shelly',
  'Milar',
  39,
  'F',
  'This is comment 6 by Shelly Milar'),
 ('shelly@www.com',
  'Shelly',
  'Milar',
  39,
  'F',
  'This is comment 7 by Shelly Milar'),
 ('shelly@www.com',
  'Shelly',
  'Milar',
  39,
  'F',
  'This is comment 8 by Shelly Milar'),
 ('shelly@www.com',
  'Shelly',
  'Milar',
  39,
  'F',
  'This is comment 9 by Shelly Milar')]

In [76]:
df = pd.DataFrame(data, columns=columns)
df

,Email,First Name,Last Name,Age,Gender,Comments
0,tom@web.com,Tom,Fake,39,M,This is comment 0 by Tom Fake
1,tom@web.com,Tom,Fake,39,M,This is comment 1 by Tom Fake
2,tom@web.com,Tom,Fake,39,M,This is comment 2 by Tom Fake
3,tom@web.com,Tom,Fake,39,M,This is comment 3 by Tom Fake
4,tom@web.com,Tom,Fake,39,M,This is comment 4 by Tom Fake
5,tom@web.com,Tom,Fake,39,M,This is comment 5 by Tom Fake
6,tom@web.com,Tom,Fake,39,M,This is comment 6 by Tom Fake
7,tom@web.com,Tom,Fake,39,M,This is comment 7 by Tom Fake
8,tom@web.com,Tom,Fake,39,M,This is comment 8 by Tom Fake
9,tom@web.com,Tom,Fake,39,M,This is comment 9 by Tom Fake
10,shelly@www.com,Shelly,Milar,39,F,This is comment 0 by Shelly Milar
11,shelly@www.com,Shelly,Milar,39,F,This is comment 1 by Shelly Milar
12,shelly@www.com,Shelly,Milar,39,F,This is comment 2 by Shelly Milar
13,shelly@www.com,Shelly,Milar,39,F,This is comment 3 by Shelly Milar
14,shelly@www.com,Shelly,Milar,39,F,This is comment 4 by Shelly Milar
15,shelly@www.com,Shelly,Milar,39,F,This is comment 5 by Shelly Milar
16,shelly@www.com,Shelly,Milar,39,F,This is comment 6 by Shelly Milar
17,shelly@www.com,Shelly,Milar,39,F,This is comment 7 by Shelly Milar
18,shelly@www.com,Shelly,Milar,39,F,This is comment 8 by Shelly Milar
19,shelly@www.com,Shelly,Milar,39,F,This is comment 9 by Shelly Milar

In [77]:
cursor = cursor.execute('select * from user')
cursor.description

(('email', None, None, None, None, None, None),
 ('first_name', None, None, None, None, None, None),
 ('last_name', None, None, None, None, None, None),
 ('address', None, None, None, None, None, None),
 ('age', None, None, None, None, None, None),
 ('gender', None, None, None, None, None, None))

In [83]:
cursor = cursor.execute('select * from comments')
result = cursor.description
result

(('user_id', None, None, None, None, None, None),
 ('comments', None, None, None, None, None, None))

In [84]:
column_names = [result[0][0],result[1][0]]
column_names

['user_id', 'comments']

In [86]:
columns = []
for i,t in enumerate(result):
    print(f'(i,t)=({i},{t})')
    columns.append(t[0])
columns

(i,t)=(0,('user_id', None, None, None, None, None, None))
(i,t)=(1,('comments', None, None, None, None, None, None))

['user_id', 'comments']

In [87]:
rows = cursor.fetchall()
rows

[('tom@web.com', 'This is comment 0 by Tom Fake'),
 ('tom@web.com', 'This is comment 1 by Tom Fake'),
 ('tom@web.com', 'This is comment 2 by Tom Fake'),
 ('tom@web.com', 'This is comment 3 by Tom Fake'),
 ('tom@web.com', 'This is comment 4 by Tom Fake'),
 ('tom@web.com', 'This is comment 5 by Tom Fake'),
 ('tom@web.com', 'This is comment 6 by Tom Fake'),
 ('tom@web.com', 'This is comment 7 by Tom Fake'),
 ('tom@web.com', 'This is comment 8 by Tom Fake'),
 ('tom@web.com', 'This is comment 9 by Tom Fake'),
 ('shelly@www.com', 'This is comment 0 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 1 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 2 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 3 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 4 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 5 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 6 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 7 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 8 by Shelly Milar'),
 ('shelly@www.com', 'This is comment 9 by Shelly Milar')]

In [88]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

           user_id                           comments
0      tom@web.com      This is comment 0 by Tom Fake
1      tom@web.com      This is comment 1 by Tom Fake
2      tom@web.com      This is comment 2 by Tom Fake
3      tom@web.com      This is comment 3 by Tom Fake
4      tom@web.com      This is comment 4 by Tom Fake
5      tom@web.com      This is comment 5 by Tom Fake
6      tom@web.com      This is comment 6 by Tom Fake
7      tom@web.com      This is comment 7 by Tom Fake
8      tom@web.com      This is comment 8 by Tom Fake
9      tom@web.com      This is comment 9 by Tom Fake
10  shelly@www.com  This is comment 0 by Shelly Milar
11  shelly@www.com  This is comment 1 by Shelly Milar
12  shelly@www.com  This is comment 2 by Shelly Milar
13  shelly@www.com  This is comment 3 by Shelly Milar
14  shelly@www.com  This is comment 4 by Shelly Milar
15  shelly@www.com  This is comment 5 by Shelly Milar
16  shelly@www.com  This is comment 6 by Shelly Milar
17  shelly@www.com  This is comment 7 by Shelly Milar
18  shelly@www.com  This is comment 8 by Shelly Milar
19  shelly@www.com  This is comment 9 by Shelly Milar

In [89]:
cursor = cursor.execute(sql)
cursor.description

(('email', None, None, None, None, None, None),
 ('first_name', None, None, None, None, None, None),
 ('last_name', None, None, None, None, None, None),
 ('age', None, None, None, None, None, None),
 ('gender', None, None, None, None, None, None),
 ('comments', None, None, None, None, None, None))

In [90]:
rows = cursor.fetchall()

In [91]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

,email,first_name,last_name,age,gender,comments
0,tom@web.com,Tom,Fake,39,M,This is comment 0 by Tom Fake
1,tom@web.com,Tom,Fake,39,M,This is comment 1 by Tom Fake
2,tom@web.com,Tom,Fake,39,M,This is comment 2 by Tom Fake
3,tom@web.com,Tom,Fake,39,M,This is comment 3 by Tom Fake
4,tom@web.com,Tom,Fake,39,M,This is comment 4 by Tom Fake
5,tom@web.com,Tom,Fake,39,M,This is comment 5 by Tom Fake
6,tom@web.com,Tom,Fake,39,M,This is comment 6 by Tom Fake
7,tom@web.com,Tom,Fake,39,M,This is comment 7 by Tom Fake
8,tom@web.com,Tom,Fake,39,M,This is comment 8 by Tom Fake
9,tom@web.com,Tom,Fake,39,M,This is comment 9 by Tom Fake
10,shelly@www.com,Shelly,Milar,39,F,This is comment 0 by Shelly Milar
11,shelly@www.com,Shelly,Milar,39,F,This is comment 1 by Shelly Milar
12,shelly@www.com,Shelly,Milar,39,F,This is comment 2 by Shelly Milar
13,shelly@www.com,Shelly,Milar,39,F,This is comment 3 by Shelly Milar
14,shelly@www.com,Shelly,Milar,39,F,This is comment 4 by Shelly Milar
15,shelly@www.com,Shelly,Milar,39,F,This is comment 5 by Shelly Milar
16,shelly@www.com,Shelly,Milar,39,F,This is comment 6 by Shelly Milar
17,shelly@www.com,Shelly,Milar,39,F,This is comment 7 by Shelly Milar
18,shelly@www.com,Shelly,Milar,39,F,This is comment 8 by Shelly Milar
19,shelly@www.com,Shelly,Milar,39,F,This is comment 9 by Shelly Milar

In [92]:
cursor = cursor.execute(sql)
pd.DataFrame(cursor.fetchall(), columns=[x[0] for x in cursor.description])

,email,first_name,last_name,age,gender,comments
0,tom@web.com,Tom,Fake,39,M,This is comment 0 by Tom Fake
1,tom@web.com,Tom,Fake,39,M,This is comment 1 by Tom Fake
2,tom@web.com,Tom,Fake,39,M,This is comment 2 by Tom Fake
3,tom@web.com,Tom,Fake,39,M,This is comment 3 by Tom Fake
4,tom@web.com,Tom,Fake,39,M,This is comment 4 by Tom Fake
5,tom@web.com,Tom,Fake,39,M,This is comment 5 by Tom Fake
6,tom@web.com,Tom,Fake,39,M,This is comment 6 by Tom Fake
7,tom@web.com,Tom,Fake,39,M,This is comment 7 by Tom Fake
8,tom@web.com,Tom,Fake,39,M,This is comment 8 by Tom Fake
9,tom@web.com,Tom,Fake,39,M,This is comment 9 by Tom Fake
10,shelly@www.com,Shelly,Milar,39,F,This is comment 0 by Shelly Milar
11,shelly@www.com,Shelly,Milar,39,F,This is comment 1 by Shelly Milar
12,shelly@www.com,Shelly,Milar,39,F,This is comment 2 by Shelly Milar
13,shelly@www.com,Shelly,Milar,39,F,This is comment 3 by Shelly Milar
14,shelly@www.com,Shelly,Milar,39,F,This is comment 4 by Shelly Milar
15,shelly@www.com,Shelly,Milar,39,F,This is comment 5 by Shelly Milar
16,shelly@www.com,Shelly,Milar,39,F,This is comment 6 by Shelly Milar
17,shelly@www.com,Shelly,Milar,39,F,This is comment 7 by Shelly Milar
18,shelly@www.com,Shelly,Milar,39,F,This is comment 8 by Shelly Milar
19,shelly@www.com,Shelly,Milar,39,F,This is comment 9 by Shelly Milar